#  Задача: HTML
#  Напишите программу, которая собирает HTML из компонентов
#  1. Запросите у пользователя название страницы.
#  Это то что будет написано внутри блока <title>ЗДЕСЬ</title>
#  2. Запросите у пользователя фразу для отображения страницы.
#  Это то что будет написано внутри блока <p>ЗДЕСЬ</p>
#  3. Запросите у пользователя путь к файлу с изображением. Они сохранены в папке images.
#  Вы можете выбрать любое из них, или загрузить своё из интернета. Это будет указано в теге <img src=”ЗДЕСЬ”>
#  4. Готовый HTML текст нужно хранить в переменной html_text.
#
#  Заметьте, несмотря на перевод строки, все теги должны содержаться в одной переменной html_text.
#
#  Пример:
#
#  Enter title name: Страница с котом
#  Enter text: Здесь лишь одна фотография
#  Enter image path: images/cat.jpg
#
#  Your HTML:
#
#  <title>Страница с котом</title>
#  <p>Здесь лишь одна фотография</p>
#  <img src="images/cat.jpg">

html_text = ...
